Catalogs/Параметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Параметры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияПоЦеновымГруппам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Параметры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайловЦеновыеГруппы.Форма.Форма" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище); 
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	ТоварыИзХранилища.Колонки.Добавить("ЦеноваяГруппа");
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		Если ТипЗнч(СтрокаТоваров.Номенклатура) = Тип("СправочникСсылка.ЦеновыеГруппы") Тогда
			СтрокаТоваров.ЦеноваяГруппа = СтрокаТоваров.Номенклатура;
		Иначе	
			СтрокаТоваров.ЦеноваяГруппа = СтрокаТоваров.Номенклатура.ЦеноваяГруппа;
		КонецЕсли; 
		
	КонецЦикла;
	
	ТоварыИзХранилища.Свернуть("ЦеноваяГруппа, Цена");
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		
		ПараметрыОтбора = Новый Структура("ЦеноваяГруппа", СтрокаТоваров.ЦеноваяГруппа);
		НайденныеСтроки = Объект.ЗначенияПоЦеновымГруппам.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() Тогда
			Для каждого Строка Из НайденныеСтроки Цикл
			
				Строка.Значение = СтрокаТоваров.Цена;
			
			КонецЦикла; 
		Иначе	
		    НоваяСтрока = Объект.ЗначенияПоЦеновымГруппам.Добавить();
			НоваяСтрока.ЦеноваяГруппа = СтрокаТоваров.ЦеноваяГруппа;
			НоваяСтрока.Значение = СтрокаТоваров.Цена;
		КонецЕсли; 
		
		НоваяЦена 			= СтрокаТоваров.Цена;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	ПараметрыФормы.Вставить("ЗагружатьКоличество", Ложь);
		
	ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайловЦеновыеГруппы.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	
КонецПроцедуры
